#version: 0.2
n g
k u
e l
a n
e n
k h
s i
l a
t i
e m
t s
w a
l e
l o
b a
i n
p h
a k
d z
i s
o n
t f
y a
l u
ng a
ts i</w>
l a</w>
u m
l i
s e
w a</w>
el a</w>
e k
t a
u n
b u
n a
b e</w>
e ku
i m
h a
em a
ak a
d v
el i
ng i
w e
en t
s a
l e</w>
en i</w>
b e
ti n
w u
b a</w>
k a
s h
m a
el e</w>
y e</w>
h la
N g
kh e</w>
t si
i k
e t
kh o
kh a
kh u
w e</w>
b an
ku tsi</w>
b o
e ,</w>
t i</w>
i ,</w>
l o</w>
l u</w>
n e
o m
an a</w>
y e
tf u</w>
k w
b h
ng u
a m
ng e
s i</w>
k wa
b on
K u
tf u
o be</w>
ng a</w>
b i
e .</w>
y a</w>
k an
b o</w>
an d
t e</w>
c a
is a</w>
l el
dz e</w>
f u
an e</w>
n j
an i</w>
y i
u k
ku lu
l i</w>
in i</w>
s e</w>
on khe</w>
le si
lo ku
dz a
k o</w>
la ba
t h
t e
l en
ti m
kh on
v e</w>
o .</w>
S im
n i
o ,</w>
tsi :</w>
t a</w>
lo m
t j
a ,</w>
khu lu
el o</w>
w o</w>
ng en
i .</w>
f un
e s
l w
Sim aka
s a</w>
le ti
dz a</w>
tf o</w>
r a
t o</w>
ts a
kulu n
m a</w>
ya wu
l eli
se b
ent a</w>
S i
a .</w>
l an
en ti
b ek
N kulun
e si
h lo
ts a</w>
k e</w>
ts e
f an
ak o</w>
ent i</w>
l ela</w>
dv o
h lu
ha m
y o</w>
ng eku
is h
dv wa</w>
el i</w>
B a
k o
ph a</w>
ng obe</w>
kan ye</w>
. .
b ha
ph i
M a
kha tsi</w>
L o
tf o
c o
w en
si n
ph a
ng em
k we
e r
ku lu</w>
g a
c h
kh o</w>
N a
n em
ng ek
c in
en d
v i
b i</w>
nj e
ta wu
h o
khon a</w>
l is
n eku
y in
ak a</w>
Nkulun kulu</w>
el u
khu lu</w>
s o</w>
m i</w>
kho si</w>
L i
Simaka dze</w>
i le</w>
t u
ban tfu</w>
ng an
e ti
L a
un tfu</w>
le tin
la m
r i
ik a</w>
k a</w>
Ng i
h le</w>
l wa</w>
w eni</w>
fu tsi</w>
z e</w>
l em
s ha
ng ema
ku m
n om
v a</w>
L e
- ke</w>
j a
um a</w>
in e</w>
ph o</w>
. ”</w>
I n
i ng
c on
tsi n
y eku
t o
ek a</w>
c i
a ng
la ,</w>
nga be</w>
W a
I s
ra y
.. .</w>
l wa
e b
is e</w>
u la</w>
lo n
ak e</w>
and la</w>
e a
le ,</w>
la nga</w>
im i
ng um
dz i</w>
U m
el wa</w>
s em
Is ray
y en
kh i
s uk
fan ele</w>
J es
- A
d la</w>
Simaka dz
w an
n ema
si khatsi</w>
wa tsi:</w>
ko dvwa</w>
Ng a
h la</w>
s en
y ini</w>
la ma
se ku
- Isray
S a
le .</w>
d a
is o</w>
kh e
an an
k u</w>
lo ko</w>
. "</w>
ts an
bon a</w>
in y
d lela</w>
K h
ba m
la .</w>
c e
ca la</w>
sh o</w>
em b
dvo dz
g u
n obe</w>
M o
dv o</w>
f a
k e
ak o
sh i
d o
la pho</w>
m i
le k
l eni</w>
u ti
dz i
c a</w>
kh e,</w>
ku be</w>
is i</w>
u ,</w>
et h
nga ph
a r
ng eli
n y
kh e.</w>
e v
nom e</w>
K o
s o
g o
le ku
E ma
kw em
c wa
ph i</w>
ph e
ngek e</w>
ph um
l in
khulu ma</w>
N i
y em
ent e</w>
s u
ch u
Ng u
bh u
bi li</w>
sh a</w>
t em
ng o</w>
tsin i</w>
s wa</w>
w ane</w>
ts e</w>
J o
b en
seb enti</w>
r o
is wa</w>
ph in
dvo dza</w>
Jes u</w>
v u
T i
a be
en dv
h lan
D a
u ya
hla la</w>
r is
la ban
et a</w>
lo lu
v um
ku n
v i</w>
si m
y el
d e</w>
la be
on a</w>
tse tfo</w>
la la</w>
w em
lu ng
g e
kho m
bo ,</w>
bek a</w>
2 0
ng c
ph aka
lan dz
Ko dvwa</w>
dza wo</w>
t eku
an i
ng et
ham ba</w>
lel o</w>
P h
wa m
el a
f i
ph endv
ku ze</w>
f ik
si ,</w>
b eku
ph o
y is
p a
g i
w eku
u lu
y o
d e
t onkhe</w>
dvodz ana</w>
be se</w>
ya ,</w>
N e
se k
ku te</w>
hla ngan
un ye</w>
ng o
seb enti
j e
g cin
k i
L u
ne ti
nj e</w>
si ve</w>
B ha
uti fu
n ak
um untfu</w>
ph u
el we</w>
ph el
v e
on i</w>
ng ani</w>
ka khulu</w>
u lu</w>
d i
bh i
do lo
kha tsini</w>
bon khe</w>
w ana</w>
Nkulun kulu
a nga
kw eku
v a
b el
uk a</w>
f a</w>
and le</w>
e tin
a ku
lo ,</w>
kh a</w>
L en
o r
n en
Simakadz e,</w>
J u
n ya
kh an
lo .</w>
fun a</w>
nga m
z a</w>
in i
a ba
u si
la bo</w>
im i</w>
t en
f ika</w>
phin dze</w>
h li
lw ane</w>
eli ,</w>
w enta</w>
B ea
kum ele</w>
nj a
c ha
ng aka
am a</w>
la ka
tf um
bh a</w>
ng u</w>
ph ela</w>
e h
ti ,</w>
a si
K wa
kho ,</w>
w el
ya m
lo wo</w>
ne si
Da vi
y ek
E m
ku fanele</w>
im a
ish o</w>
la nga
k onkhe</w>
an si</w>
c e</w>
un a</w>
G i
bo .</w>
z i</w>
ban i</w>
u nga
r e
c u
-Isray eli</w>
ja bu
is eb
a ti
tsa tsa</w>
si te</w>
b eni</w>
J er
tf wana</w>
ngi z
w ele</w>
le s
- 1
nge ti
im u</w>
lo ku</w>
end e</w>
d a</w>
wa ti</w>
wa ,</w>
ne tin
z u
kw en
hla ba</w>
el ela</w>
s on
kh un
an a
le ngi
bu si
ka hle</w>
S h
u sa
we ,</w>
tf om
l isa</w>
fun dz
l ema
tfu ,</w>
um sa</w>
nge si
c an
we .</w>
d i</w>
J e
khom b
em an
B o
y ela</w>
s ema
la pha</w>
z a
A f
lw eni</w>
t s</w>
Ng ako</w>
v ik
nje ngobe</w>
ts em
hla ba
na ku
em i
wa .</w>
ti .</w>
v el
o n</w>
y i</w>
in d
. .</w>
un y
- E
z i
n an
n eli
T h
bi li
tfo la</w>
en e</w>
S o
n ik
um bu
hli ti
em khatsini</w>
l ele</w>
ek e</w>
iny aka</w>
f aka</w>
L om
dza ba</w>
B e
kho .</w>
ng el
c ane</w>
wen a</w>
ph uma</w>
tf wa
si .</w>
s aka
nga loku
ang e</w>
bu k
u .</w>
ngiz imu</w>
fik e</w>
ak o.</w>
C h
ye .</w>
y aka
T a
h le
ts el
tfu .</w>
n aka
B u
ti ve</w>
S e
kw ent
emb ik
B an
se si
lo ve</w>
tfu l</w>
se wu
ya khe</w>
seb enta</w>
T in
nom a</w>
i si
cin is
ka khulu
bu la
ya ku
l we
nge sikhatsi</w>
ng is
n o
in khosi</w>
ne ba
le ya
vum el
ako -ke</w>
v ele</w>
tin tfo</w>
kw enta</w>
phendv ula</w>
le tim
l we</w>
y et
ngen ca</w>
ng e</w>
dv u
ka ti</w>
kha ya</w>
bi to</w>
iseb enti</w>
ngeku tsi</w>
fun dza</w>
m u
khulu m
em p
d la
tin i</w>
um u
z ange</w>
be a
lo wa
w un
y enti</w>
ca ba
ku nga
hlo bo</w>
y onkhe</w>
en a</w>
el eni</w>
t ek
0 0
g ama</w>
phi la</w>
fa ti</w>
k o,</w>
dv um
ya se
c um
C a
u yawu
p o
s el
ba be</w>
ta m
ngaph andle</w>
Ni ngizimu</w>
te wu
lam an
y e,</w>
lem i
u va</w>
tf wa</w>
dv una</w>
wa se</w>
sh i</w>
en i,</w>
w ema
I m
ba ,</w>
ku suk
le so</w>
a sa
li ve</w>
L esi
ts elo</w>
y ak
tfu l
wa tsi</w>
nga tsi</w>
w eli
ph ris
in e
j u
anan anan
c en
ny aka</w>
a wu
se tj
b i,</w>
Jer usa
ya .</w>
utifu l
y an
ta ti
i l
ng ak
t ak
ngema -
k on
in i,</w>
b em
dolo bha</w>
a n</w>
' s</w>
Ng ako-ke</w>
t on
yen a</w>
el e
nge tin
y ema
B h
ro f
g h
bon aka
ke pha</w>
v u</w>
u tsi:</w>
na se
20 1
t ema
le ka</w>
tsi ,</w>
Gi bhi
phi lo</w>
ku si
dza weni</w>
lu nga</w>
ya kho</w>
Gibhi th
N khosi</w>
ng isho</w>
e bu
ngen a</w>
ku sho</w>
m ine</w>
ka m
setj enti
wa khe</w>
kan tsi</w>
hlo ko</w>
t ela</w>
r i</w>
ya lo</w>
s ela</w>
Ng obe</w>
se ba
con dz
b is
eli .</w>
w u</w>
ku ba
m an
ba nga
s :</w>
in g</w>
bu ta</w>
ba .</w>
i nga
en i.</w>
ma ,</w>
c ela</w>
om e</w>
k o.</w>
ts ela</w>
fun dzi</w>
ph e</w>
khomb isa</w>
em a</w>
b ela</w>
tse tf
1 9
Simakadz e.</w>
in a
tsa tfu</w>
bh o
we si
kw ema
w on
le yo</w>
et e</w>
lon a</w>
ulu m
li le</w>
tse tfo
t el
fan ana</w>
ng ana</w>
Kh ris
hlu k
y on
y eli
landz el
. ’</w>
hliti yo</w>
bu so</w>
sebenti sa</w>
ba tsi:</w>
sh e
nem i
ye si
ik o</w>
w o.</w>
y o.</w>
ak o,</w>
N o
U nga
om a</w>
w ent
ya mi</w>
ev eni</w>
ngi le</w>
la h
le ng
l ini</w>
lung elo</w>
h ha
am i</w>
f o
tj ela</w>
t wa</w>
um a
ph rof
i c
le sa
? ”</w>
c elo</w>
lom unye</w>
sin i</w>
ka ,</w>
Davi de</w>
si sek
h h
u tawu
Lo ku</w>
laban ye</w>
j e</w>
tsi .</w>
na m
ku ya</w>
g c
gcin a</w>
la se
bo m
eth i</w>
Na ngabe</w>
utifu l</w>
M e
li ,</w>
U ma</w>
d lu
enti wa</w>
nja lo</w>
a yi
a se
sh u
Nkulunkulu ,</w>
t u</w>
a bu
Je ho
-Isray eli,</w>
dz e
neku tsi</w>
lel in
chu beka</w>
tu ku
z o</w>
tsan dza</w>
r ika</w>
is we</w>
i ?</w>
g wa
um i</w>
be ,</w>
kw eli
u tsi</w>
ngc wel
wa khuluma</w>
ta ,</w>
sin dz
a be</w>
si kha
letin ye</w>
lo nga
na ngabe</w>
K e
y o,</w>
ngi ya
and leni</w>
ph ansi</w>
f e
uk ela</w>
in ik
w onkhe</w>
ya nga</w>
ts am
nget ulu</w>
lw imi</w>
tf un
embik wa
nak e
n ye</w>
si we</w>
el el
ek i
th a</w>
sh o
em andla</w>
cwa dzi</w>
K un
n d
t an
ka .</w>
ng elu
im a</w>
n ine</w>
tim ba</w>
suk u</w>
ku ye</w>
ba lu
L es
s an
cen ye</w>
Ju da</w>
on a
ga ba</w>
ev en
we b
Sa wu
kan i
si ta</w>
M an
kho si,</w>
tf wan
wa ba
v e,</w>
ta .</w>
landz ela</w>
in i.</w>
f ana</w>
a li
w um
na ye</w>
bu ka</w>
ma nga
j ani</w>
phendv u
wa se
ba yawu
Y e
sa m
nj ani</w>
Ngu ye
R e
lo bu
c ek
y ise</w>
n et
f o</w>
phris ti</w>
th i</w>
a g
suk a</w>
o ya</w>
ba se
Af rika</w>
le nga
kusuk ela</w>
ku ba</w>
y im
r a</w>
hla kani
w o
v ela</w>
f aka
d li
shi wo</w>
an i,</w>
bek a
L eli
bon e</w>
ho li</w>
W eb
wa mi</w>
tfo laka
Mo si</w>
r u
in a</w>
tfu tfu
ng eni</w>
ba ti
ngen dlela</w>
v o
khon a.</w>
ik ela</w>
ban tfwana</w>
N je
t ha
wa ti
lom u
ek ile</w>
ph an
ng ako</w>
emb u</w>
W ena</w>
h lel
ba ya
v e.</w>
y enti
s onkhe</w>
l ish
ku len
kho lwa</w>
ulum ende</w>
an ti</w>
i -
e khatsi</w>
t .</w>
Ba be</w>
? "</w>
lek ile</w>
v un
ph am
lam u
ku ti
el ele</w>
nga ba</w>
kha la</w>
tj e</w>
on i,</w>
na bo</w>
ba khe</w>
a ngi
seb en
r an
w o,</w>
la si
hlo ni
el a,</w>
in dlela</w>
t o.</w>
setjenti swa</w>
hla hla</w>
sisek elo</w>
tsi te</w>
ts emb
t aka
ku dla</w>
el e.</w>
S ha
lw an
ph ak
ne bu
kwa ku
hlu ph
yawu ba</w>
tfum ela</w>
s t</w>
em e</w>
dz ing
si to</w>
wa kho</w>
i ya
Ku te</w>
en i
e s</w>
li .</w>
pha hla</w>
n a</w>
C ha
K a
Ban tfu</w>
bi .</w>
cek u</w>
Ne w</w>
u ta
s andla</w>
cinis ek
m o
j a</w>
L em
nje nga
h lelo</w>
v aka
li vi</w>
tfo le</w>
ku bo
f ak
bi ta</w>
tin g</w>
g e</w>
A b
tf we</w>
ng co
c uk
s eli
lu la</w>
y isa</w>
sa ba</w>
j i
ham be</w>
e :</w>
bhu bh
hla m
si nga
v ak
ku lom
khi pha</w>
ye wu
j o
tuku lwane</w>
ta khe</w>
nik elo</w>
g co
c embu</w>
lon g</w>
ku phela</w>
and a
se ti
le be
con o</w>
b um
ku sa
ng im
n ek
le ko</w>
in ing
sa khe</w>
F i
Af ri
n e</w>
kwa ba</w>
bek e</w>
g cwa
la ba</w>
hlangan o</w>
dza la</w>
a l
n i</w>
ma .</w>
el e,</w>
g ci
n tfwana</w>
ku leli
d lel
ta bo</w>
kho kh
Ke pha</w>
kh umbu
em hla
em eh
P ha
ng i</w>
P a
el o
Jerusa lema
) .</w>
nga .</w>
is a
Ch a</w>
u be</w>
len i
B ek
tfu ku
ng ent
v eni</w>
tsan dvo</w>
pha si</w>
ba be
ku na
ema langa</w>
ba bu
kwe si
dz ela</w>
ne tim
e r</w>
ba ka
u ngi
en dzaweni</w>
n elu
is ela</w>
dvodz aka
b un
20 0
c om
Wa tsi</w>
hlu kan
si swa</w>
nga ,</w>
et i</w>
Ju d
phi we</w>
si sa</w>
l ani</w>
ti on</w>
am u
khi ci
k i</w>
lo we
d o</w>
i n</w>
te r
k em
um sebenti</w>
lo ngu
d lu</w>
bu tfo</w>
ng in
caba nga</w>
Nkulunkulu .</w>
la ko</w>
bea utiful
H a
an d</w>
lo na
ku ma
to lo</w>
ngem uva</w>
kweku tsi</w>
tsan dz
m e
K ha
a ngeke</w>
le se
go li
A r
T im
pha tsa</w>
enti we</w>
a khe</w>
k im
ta li</w>
R a
ku li
d leni</w>
S u
Kwa tsi</w>
th emp
m en
ngc wele</w>
on g</w>
ngo ba</w>
la ph
g om
G a
i le,</w>
M tsetfo
u t
li langa</w>
le tsa</w>
ik et
m in
lel wa</w>
lel i</w>
khulu ,</w>
zu lw
k e,</w>
ku ya
ima li</w>
f e</w>
wen u</w>
ngaph ansi</w>
sh wa</w>
ku tawu
m ake</w>
th e</w>
ni nga
le t
ema dvodza</w>
u ngu
tj a</w>
y eni</w>
m e</w>
Ngi ya
Y ini</w>
in dzawo</w>
end lini</w>
vumel wane</w>
s .</w>
r i,</w>
ngi yawu
h le.</w>
el a.</w>
be ba
N ak
we ti
vi de
r e</w>
el ine</w>
bam ba</w>
v am
b u</w>
lon khe</w>
khon ta</w>
bon o</w>
M i
h ulumende</w>
bu yis
Bea utiful</w>
< li
le te
kakhulu .</w>
cha z
<li >
ku bo</w>
Nguye n</w>
khu la</w>
kh um
ma li</w>
u sa</w>
q u
ya tsi:</w>
ngu -
hla le</w>
S om
ku lesi
dvodzaka ti</w>
b in
o f</w>
ik eta</w>
phaka m
nga yo</w>
g a</w>
y ele</w>
tfolaka la</w>
loku shiwo</w>
Y a
wa la</w>
kwa ti</w>
h u
dza ,</w>
M ine</w>
un even
c h</w>
b eli
In khosi</w>
-Isray eli.</w>
laba be
ba ba
lw eku
ek ela</w>
Um untfu</w>
. [
lis e</w>
et ulu</w>
el ani</w>
dz e.</w>
d e,</w>
1 0
ik e</w>
ngen e</w>
nge bu
t ana</w>
nje ngem
r es
im inyaka</w>
g am
se ngi
bha la</w>
ya wo</w>
ta ku
hla tj
b ele</w>
lis o</w>
wa ba</w>
te si
ja lo</w>
a s
tfutfu k
Len a</w>
Khris tu</w>
< /
sa kho</w>
w ente</w>
dzi ngek
H e
yel ana</w>
tse ng
nga ti</w>
ta se
ngek we
wa ko</w>
ku ye
tf o,</w>
li m
kwe ti
khulu .</w>
f u</w>
dolo bh
li bito</w>
Jo h
o u
la khe</w>
is e
nga lo
y ane</w>
ham bis
Web site</w>
V i
L in
si kati</w>
ik i
hla sela</w>
bili .</w>
i le.</w>
p u
en a
bu sa</w>
. '</w>
th anda
ta kho</w>
h i
K an
a tsi:</w>
Simakadz e
F ar
na laba
dzi nga</w>
hla ngana</w>
s ele</w>
h le,</w>
yam i,</w>
le tati
sim o</w>
hlan u</w>
dza .</w>
I mi
phum ela</w>
l ane</w>
ku le
khon a,</w>
“ A
n ani</w>
Ngu bani</w>
ye ti
si te
sha ya</w>
na lo
lom o</w>
dz ima
ch i
tf o.</w>
si ya
s t
gom o</w>
eman ti</w>
M ake</w>
L is
m un
lem a</w>
ku la
kwa khe</w>
phaka tsi</w>
f iso</w>
ent o</w>
c eleni</w>
Bha bhu
! ”</w>
y u
le ke</w>
e n</w>
uk e</w>
th u
len a</w>
ku yawu
ining wane</w>
c k</w>
La ba
v im
si celo</w>
k et
el ek
bh e
Bea utiful
e khaya</w>
len ye</w>
ba ng
and la,</w>
h a</w>
B onkhe</w>
- ke,</w>
ngi nga
ya bo</w>
li lo</w>
laman ye</w>
f ake</w>
ba la</w>
( 1
ku -
ent ela</w>
H am
lis wa</w>
nget e</w>
dzima te</w>
R i
J a
sh e</w>
li ngan
kha sh
Sim phiwe</w>
Lo ko</w>
G o
“ Ngi
le y
l l</w>
bu lala</w>
Jo se
on e</w>
na -A
li we</w>
leti si
dz el
ts ele</w>
ngi lo
ngi ku
h lela</w>
an e,</w>
V el
te ti
N dvodzana</w>
dz e,</w>
Ku fanele</w>
im isebenti</w>
g i</w>
e ba
L eti
ta ma</w>
s we</w>
phrof ethi</w>
is a.</w>
Ng em
su ku
sa y
nd eni</w>
lel a
bh ek
ta lwa</w>
r o</w>
e kha
ngeli langa</w>
n dza
ban e</w>
et ela</w>
Bea siswa</w>
u M
bi le</w>
b ema
N am
K we
si ko</w>
bi an</w>
s eni</w>
khun dleni</w>
yi bh
t o,</w>
ngu bani</w>
eti kwa
con dvo</w>
Mo ya</w>
La ma
khon o</w>
d lo</w>
Jerusa lema</w>
phe tse</w>
lo ko,</w>
cum o</w>
u bu
so lo</w>
na mi</w>
i be</w>
P o
ku yo</w>
ya khe,</w>
la ti
Ng eku
y oni</w>
.. .
ri ya</w>
n tfwan
u ku
ish a</w>
dz ini</w>
d la,</w>
wen i.</w>
t e.</w>
se bu
ngem i
n el
ti ng
on o</w>
fun dvo</w>
e -
t t
za tfu</w>
lo be</w>
fu la</w>
cin iso</w>
Nje ngobe</w>
Nga be</w>
um tsetfo</w>
u yi
k imi</w>
dza bu
ba fundzi</w>
si ti
V u
lel is
bili ,</w>
lengi we</w>
kan tolo</w>
a )</w>
phi le</w>
phe f
ku khona</w>
g u</w>
bi twa</w>
na se</w>
lo ve
bon elo</w>
s o.</w>
kwe tin
kakhulu ,</w>
in tfo</w>
lu tfo</w>
en ce</w>
zi nga</w>
Lo ku
C o
w i
th ic
faka zi</w>
tsi m
se yi
in ya
le ta
is a,</w>
gc wele</w>
be asi
ba la
lung is
kh ish
wan o</w>
wa khe,</w>
tim a</w>
hluk ene</w>
un e</w>
t eli
nge khatsi</w>
laba m
K um
w and
li ></w>
</ li></w>
tsem ba</w>
tj ele</w>
r ea
lwa ,</w>
p e
dv wa
b enta</w>
tsem bek
d lo
bu ya</w>
s ,</w>
bu hlu
an i.</w>
So lom
p i
om i
tsa tse</w>
ti ya
ph ele</w>
kho si.</w>
e tim
ba se</w>
N o</w>
th ula</w>
sen i
m unye</w>
in dvodza</w>
ra ha
R o
N an
ta la</w>
d le</w>
c o</w>
ta wa
kh and
ba li
e d
vik ela</w>
Jud a,</w>
lwa .</w>
e Gibhith
b elo</w>
wu ,</w>
hla ka
sa mi</w>
tfom bi</w>
la ti</w>
F un
2 0</w>
g o</w>
Fi lis
na to</w>
ba tsi</w>
H o
ya kho,</w>
tin dlela</w>
cha za</w>
bonaka la</w>
tj a
t y</w>
tsa ba</w>
s elu
langa ,</w>
w ela</w>
r am
e hlu
Bha yibh
“ U
ng weni</w>
kim i,</w>
el in
tfu pha</w>
a bo</w>
H la
v in
ngilo si</w>
ku ca
el elo</w>
na wo</w>
m o</w>
li ma</w>
la li
ema -Israyeli</w>
u li
nga ti
lelin ye</w>
A be
1 8
ngek wem
ki nga</w>
khe tsa</w>
gu c
na wu
dv un
ya khe.</w>
su ngu
om u</w>
je z
hla .</w>
el ana</w>
a ya
phrof eth
nja lo,</w>
l y</w>
ku to</w>
wen i,</w>
ten u</w>
la wo</w>
j wa</w>
wam i,</w>
wa bo</w>
r d
g un
ent s</w>
be ti
p a</w>
chu bo</w>
bo nga</w>
D o
D e
, "</w>
ts aka
t h</w>
sa ,</w>
ngaph am
Sawu la</w>
s wa
ng un
inik elo</w>
f a,</w>
e N
Nak u</w>
A si
1 1
tin hla
t e,</w>
phef umu
y ent
ti c
nga se
n ako</w>
L ema
H lengiwe</w>
y ona</w>
v er
m untfu</w>
ce dza</w>
b y</w>
tsi wa</w>
khulum e</w>
Ta g
I ma
ya se</w>
s to
le to</w>
ce bo</w>
busi so</w>
be si
nga be
ngu ye</w>
lo w
kwa m
kho sini</w>
jabu la</w>
goli de</w>
d u
li fa</w>
lama bili</w>
ku phel
L am
w ini</w>
k ona</w>
b isa</w>
A n
tsi ni
na we</w>
ind lu</w>
fundz isa</w>
G e
le y</w>
ch um
ba ku
v ula</w>
shi ya</w>
ma yelana</w>
N ome</w>
Khris tu
web site</w>
sin dvo</w>
end lu
ema dvodzana</w>
dolo bha
iny enti</w>
hluph ek
e Ningizimu</w>
Ngi yawu
hla lo</w>
Mtsetfo sisekelo</w>
s o,</w>
nya ma</w>
nje nge
kho h
ti wa</w>
ngi tsi</w>
na lowo</w>
leya yi
l y
kuye :</w>
kho si
cin dz
Ng esi
ma r
v a,</w>
ngem nyaka</w>
j am
in iningwane</w>
gh t</w>
e M
ban tfu,</w>
ti nga
ta li
ku laba
e ;</w>
bu ye</w>
ne s
kwa kho</w>
and la.</w>
P awu
wa ya</w>
sa se
lel u
hliti y
e sa
B esi
ti ko</w>
nake d</w>
na loku
lu sito</w>
lin ye</w>
gi j
ak an
Li ve</w>
nj e,</w>
ema vi</w>
dzing o</w>
d i,</w>
c el
tf uny
k eti
i le
fu tsa</w>
a sh
U ya
tim e</w>
la kho</w>
Y ea
La ban
Jeho va</w>
D eli
ng wane</w>
langa .</w>
beasi swa</w>
la la
is ana</w>
el ini</w>
! "</w>
tfu ba</w>
phum a
ag o</w>
lwa ti</w>
end lu</w>
d la.</w>
ts a,</w>
say s:</w>
len khulu</w>
ku bha
an a,</w>
1 2
y eli</w>
t ake</w>
ngi tawu
ku bona</w>
fo r</w>
bha lo</w>
Le vi</w>
tsa tfwa</w>
themp eli</w>
li be</w>
is ha
hla z
bu yela</w>
ba kho</w>
phel ele</w>
nge ph
na bo
ma ti
c am
a wa
0 .</w>
khan dza</w>
dolobh eni</w>
Le tin
can dz
bek wa</w>
ba bo</w>
un tfu,</w>
khun dla</w>
be te</w>
K ho
ta mi</w>
en u</w>
ban tfwa
Davi de,</w>
yin ye</w>
si tawu
ngeku landzela</w>
lo ko
kh we
i Nkhosi</w>
d .</w>
ngam eli</w>
lesi nye</w>
ku we</w>
i yawu
bu to</w>
Ma r
-A m
sh is
pha wu</w>
h ho
condz ana</w>
tu ngel
ngcwel e,</w>
li si
l and
ku wo</w>
hle ti</w>
ban tfu.</w>
B eku
w elu
ph ik
la Simakadze</w>
b ik
we tfu</w>
v en
ngen a
kan jani</w>
f iny
e celeni</w>
Sh e
y enta</w>
nga phasi</w>
el eka</w>
J ak
ye ar
wu lo</w>
ve l</w>
ku Simakadze</w>
i we</w>
be .</w>
Jerusalema ,</w>
A ka
u r
em hlaba
e t</w>
balu lekile</w>
(1 )</w>
y i,</w>
ts ek
ni yawu
c em
vide o</w>
tfu la</w>
ku lo</w>
hlatj elo</w>
hambis ana</w>
bu lo</w>
T o
B usi
z in
yin i?</w>
u ba
li va</w>
le ba
ish i
h lom
ako :</w>
1 4
se kutsi</w>
c ham
) ,</w>
y elu
uk u</w>
t ane</w>
sa .</w>
nya lo</w>
le :</w>
end lel
0 0</w>
wa kha</w>
wa ka
ti s
chu bek
a se</w>
O n
K onkhe</w>
tsin e</w>
th i,</w>
a ba</w>
Jak obe</w>
khon a
im philo</w>
T ha
R u
khu tsa
b )</w>
sha ngatsi</w>
on i
leli ve</w>
kh wa</w>
hha yi</w>
an e.</w>
Em vak
em seben
bea utiful</w>
aka zange</w>
a tsi</w>
0 ,</w>
z ar
th ende</w>
k ini</w>
hla ,</w>
ba mi</w>
W e
-1 9
w ona</w>
na yo</w>
kulun kulu</w>
eth emp
emeh lo</w>
dz eni</w>
c k
B i
s ak
nga so</w>
lis ela</w>
Vel onkhe</w>
S in
ye bo,</w>
un a
ri ya,</w>
kw elu
a l</w>
C on
suk e</w>
ku ta
ka bi</w>
M in
Bhabhu lona
t andla</w>
emhla ben
c ele</w>
1 5
un i
te r</w>
laban yenti</w>
in hlitiyo</w>
1 3
tim phahla</w>
phaka dze</w>
ku ku
Ng en
sh isa</w>
pho yisa</w>
no ko</w>
lah lek
k isi</w>
f isa</w>
a kho</w>
B es
te d</w>
sek ela</w>
nga sem
letin yenti</w>
i tawu
h an
ne bantfu</w>
Si ya
Li bito</w>
H ome</w>
! !</w>
ta l
la mi</w>
hlitiy weni</w>
es andleni</w>
el o,</w>
Ph ela</w>
Jes usi
wa si
ngi ti
khulum o</w>
is ele</w>
aka m
Ma hla
sh umi</w>
le be</w>
ka hle.</w>
emhla beni</w>
ca shi</w>
yin khosi</w>
ti on
se ,</w>
phe ph
ngu Simakadze</w>
lu ngile</w>
landzel ako</w>
ku phila</w>
y wa</w>
ti be</w>
thic o</w>
ku ye,</w>
khan ya</w>
f a.</w>
ek i</w>
an a.</w>
Ni nga
00 0</w>
pha tsim
in ye</w>
et wa</w>
bek we</w>
b elu
anananan anananan
, ”</w>
em vak
Sha ngatsi</w>
N em
wa phendvula</w>
lel we</w>
D an
ye tin
v a.</w>
lu ngi
i N
emeh lweni</w>
" A
uneven tful
nje ngen
li ma
.. ..</w>
ng ini
kh el
j ik
bon i</w>
S A
B am
3 0</w>
w andle</w>
lesi khatsi</w>
la lela</w>
hla ngabe
esi khundleni</w>
an e
1 0</w>
tfwa lo</w>
labe ngaba</w>
la ka</w>
ku we,</w>
khun i</w>
khi wa</w>
fun i</w>
ek we
bho kisi</w>
nga len
nem andla</w>
na -
kusuk a</w>
em eta</w>
D i
Ba tsi</w>
vel onkhe</w>
t eka</w>
c ish
Em p
2 )</w>
yin tfo</w>
y elo</w>
nga lo</w>
ndza won
na sem
n cane</w>
lu hla
letim bili</w>
lama dvodza</w>
cindz et
beku ngu
wa yi
n im
la wu
ge s</w>
g ula</w>
e zulw
G u
um hlaba</w>
tsa .</w>
p e</w>
nan dzi</w>
kwent ela</w>
ca la
L e</w>
1 7
( a)</w>
ny aka
lan dvo</w>
ku sebenta</w>
ba ba</w>
lom khulu</w>
gcin e</w>
em u</w>
Ye bo,</w>
J ako
suk ela</w>
sin ye</w>
M tsetfo</w>
v eta</w>
ts eni</w>
ti yawu
sa si
om ish
n o</w>
la ku
khu ngo</w>
khand lu</w>
buhlu ngu</w>
ya ma
wa khe.</w>
tsa beni</w>
ti tukulwane</w>
ak e
S eb
Na ta
Jo shu
ye bu
phaka dze.</w>
kubo :</w>
hlo la</w>
ca lek
bh aka
No ko</w>
tim u
si be</w>
man je</w>
lo kwa
li cala</w>
Jose fa</w>
uk ele</w>
ge be
ba si
I -
yel we</w>
wa be</w>
li ya
le ;</w>
khom o</w>
A ku
phak eme</w>
la lel
l d</w>
ku tsi:</w>
khe ;</w>
kha tsa
eh lo</w>
Deli gh
" U
r y</w>
le ngema-
lamu hla</w>
kwent eka</w>
kw el
f omu</w>
ak eni</w>
T onkhe</w>
L et
19 9
s ent
nge kho</w>
lom untfu</w>
kusa sa</w>
hlo so</w>
v isi</w>
sen dvo</w>
nam unye</w>
lo g
li gama</w>
kw entiwa</w>
end lula</w>
ang eli
Pawu la</w>
vik i</w>
lo ts</w>
em et
e ng
dv weni</w>
cum bi</w>
zu zo</w>
um ntfwana</w>
ti -
phatsim andla</w>
p r
ku yi
b iko</w>
S wa
Ng ema</w>
2 3
si ka</w>
s u</w>
le ye
ka bu
Le vel</w>
Gibhith e</w>
ya ma</w>
wa hamba</w>
ulu ,</w>
son o</w>
sha ,</w>
ngu bo</w>
-A b
v uka</w>
v u,</w>
nga sen
hlaba ,</w>
em inyaka</w>
dv o.</w>
S is
ta g
si pa
longu Som
kwem i
h lo</w>
d e.</w>
Vu si</w>
V a
Ngesi khatsi</w>
t ent
ngent eka</w>
mi tha</w>
i ;</w>
ya kho.</w>
tf weni</w>
tem i
t :</w>
si le</w>
ngu lu
dz ima</w>
bhubh isa</w>
Bhayibh eli</w>
“ N
ye tfu</w>
yak we
t elu
ph i,</w>
ph en
i r
hlu leka</w>
Mo wa
tawu ba</w>
phum elel
ngum untfu</w>
f or
et andleni</w>
c s</w>
M u
Li fe
ya tselo</w>
imi yalo</w>
ek a
2 4
tu lu</w>
na le
lw em
lo ko.</w>
la gi</w>
dv on
tj wa</w>
su sa</w>
r oni</w>
gu gu</w>
go dzi</w>
e ta
1 6
y eli,</w>
ngo ti</w>
ma sin
lu lwimi</w>
la ngema-
kwa tsi</w>
ku Simakadze,</w>
khumbu la</w>
ke ting</w>
d lala</w>
cinisek isa</w>
busi siwe</w>
be r
wa bo
um fati</w>
tsetf weni</w>
t we</w>
f ela</w>
bu la</w>
z ulu</w>
z ing
u t</w>
lin dz
letin tfo</w>
kon dlo</w>
khulu ny
ca la.</w>
ban tfwan
a ben
Lo wo</w>
um oya</w>
ta khe,</w>
phefumu lo</w>
nge sa
na nga
dvu te</w>
can e.</w>
bo lo</w>
nje ngesi
n ani
lis i</w>
li ng
k imi
h lek
con dze</w>
bon dza</w>
Sa th
Ph et
“ Ku
wa yini</w>
tse nga</w>
seb ent
on i.</w>
etin dzaweni</w>
M hlaba</w>
E ku
tin dzawo</w>
si ta
la bantfu</w>
la ;</w>
ku phi</w>
khi we</w>
k ake</w>
ish umi</w>
ing o</w>
ind eni</w>
en jam
ban ti</w>
ba lwa</w>
B ani</w>
sa la</w>
ma n</w>
kwa bo</w>
kem ba</w>
in dvodzana</w>
im o
f ish
z i,</w>
pha tsi</w>
na si
lo k
fik eti</w>
con dza</w>
c wan
Jo rd
2 2
si vumelwane</w>
phe pha</w>
li ti
le -
im u,</w>
g we
bu lu
bhi dli
a yawu
Kan tsi</w>
wa tsatsa</w>
ngu lo
ng enta</w>
j i</w>
ca la,</w>
be wu
ban dla</w>
tsam bo</w>
ta r
sebenti .</w>
na labo</w>
ema gama</w>
dvum o</w>
ba yi
ba ya</w>
ba te</w>
Si bo
ya yi
umu sa</w>
tfutfuk isa</w>
ngu Simakadze,</w>
khon e</w>
ha ,</w>
el ine
dz in
ak i</w>
W onkhe</w>
2 1
u se
tfom be</w>
nga -
kwa mi</w>
-E f
zin isi</w>
n in
iket wa</w>
ba nga</w>
S ong</w>
S am
y .</w>
tsetf o,</w>
ngi ngeke</w>
f ile</w>
chu bom
Le vel
H lu
F u
A l
un tfu.</w>
ton o</w>
tj ana</w>
te tin
phakam isa</w>
na ngi
lo si
le s</w>
esi veni</w>
a kha
L on
Ab raha
( b)</w>
v uma</w>
sha do</w>
e l</w>
Me ngameli</w>
Kh en
yen u</w>
phum u
nak u</w>
ku se
ku faka</w>
gu cu
ben e</w>
Th e</w>
M ini</w>
-Isray eli
uneven tful</w>
tfom bo</w>
ngcwel e.</w>
kw entiwe</w>
e d</w>
za lwane</w>
yi phi</w>
wa kho,</w>
lo -ke</w>
laba nga
in cenye</w>
dla lo</w>
Laban ye</w>
" Ngi
yenti .</w>
year s</w>
sh ona
p p
lu m
loku bi</w>
g cu
end lela</w>
eman g</w>
a ma
S en
Joh ane</w>
Far o</w>
. </li></w>
nema dvodzana</w>
len dzawo</w>
ku tfola</w>
i t
er i
ea r
bhu j
U yawu
H u
Bh enjam
tin yanga</w>
sha d
sh i,</w>
ma condzana</w>
leti nga
ku fa</w>
ke ta
i tsi:</w>
enti le</w>
dz i,</w>
ng o.</w>
lu si
hlaba tsi</w>
a d
Afri ka.</w>
ngi yaku
len i,</w>
kw an
kun ye</w>
ku lo
kha timu
i la
ba phristi</w>
P r
J obe</w>
A ngi
1 ]</w>
wa kho.</w>
wa Nkulunkulu</w>
tsin tsa</w>
phendvu lo</w>
nje ngeli
ngapham bi</w>
lo se
lel an
be yi
ba tawu
S on
Beautiful ,</w>
? ?
3 )</w>
sh iswa</w>
s enta</w>
nga to</w>
nga loko</w>
na seku
lama tsatfu</w>
ho la</w>
ethemp elini</w>
esi ga
bhi zinisi</w>
bha lwe</w>
Pha lam
In dlela</w>
ye -
ya mi
y elwa</w>
wa fike</w>
w entiwa</w>
ti lwane</w>
sha .</w>
phin dza</w>
ngu -1
ngi ta
fan eli</w>
em e
chubom gomo</w>
bo sh
ya yo</w>
wen u,</w>
t ele</w>
lo ka
E ti
sin e</w>
ku Nkulunkulu</w>
ing i</w>
ba lek
ak ek
Ne w
Mo si,</w>
Ku be</w>
1 .
wa -A
tsetf o.</w>
ti sa</w>
phum e</w>
nje ngeku
ngem andla</w>
ku njalo,</w>
hloni ph
hla bel
emseben tini</w>
bam bis
ba holi</w>
Solom oni</w>
ng aka</w>
k ini
i s</w>
e Jerusalema</w>
ci ph
b le</w>
b isi</w>
Vi de
1 2</w>
vum e</w>
tse ngis
na ngeku
li le.</w>
ku bu
khu ph
khash ane</w>
kan cane</w>
Ng eli
Na wu
v elo</w>
u ngum
sa yi
Jesusi ta</w>
v i,</w>
tin i.</w>
ngu Nkulunkulu</w>
bu ke</w>
Filis ti</w>
2 5
ti le</w>
phris ti,</w>
kho kho</w>
kh i</w>
in dza
fu nga</w>
ema lungelo</w>
bam be</w>
Lo lu
L el
l ana</w>
gcin eni</w>
em uva</w>
com m
Yea r</w>
M ana
Kh e
Jerusalema .</w>
A d
um timba</w>
u yise</w>
ta bo,</w>
ku cala</w>
i l</w>
fan ek
Ngu yen
Bha la</w>
tj in
si ka
ngen isa</w>
ng ela</w>
loku nga
len i.</w>
ku labo</w>
kho lo</w>
kh wa
kan jalo</w>
hlaba .</w>
et j
an g</w>
abe sa
On khe</w>
L isa</w>
Kh omish
Fun dza</w>
v o</w>
sema -Israyeli</w>
lelan dzel
la k
ja ha</w>
ema dolobha</w>
em o
co ka</w>
bo ma
a phindze</w>
W o
E n
ye M
w n
u n</w>
ti kha
seku dla</w>
na ba
hlangan isa</w>
ce ce
ca le</w>
C om
t r
nek we
loku m
hha shi</w>
aku si
N ami</w>
A m
ye a
ni ya
ng o,</w>
lesi khulu</w>
le ngen
ku bon
ik wa</w>
dvum isa</w>
bo ngo
ani ?</w>
S eku
F a
zu z
u funa</w>
tim e
ti tsa</w>
nja lo.</w>
nj e.</w>
n cono</w>
hlo n
dz i.</w>
Sa ba
B eka</w>
ya Simakadze</w>
uk el
si yawu
p ela</w>
p ani</w>
ngaph in
lan d</w>
ba ngi
ba hamba</w>
Ma ga
tim eline</w>
si phi</w>
n ake</w>
l .</w>
hlakani pha</w>
tfo ko
sh uma
r .</w>
khel wane</w>
kha m
bo ba
F utsi</w>
-A si
ya ba</w>
wa wu
tfom ba
n ika</w>
loku ngen
khi phe</w>
in dzaba</w>
el o.</w>
Les bian</w>
Ema dvodzana</w>
2 1</w>
1 1</w>
yek ela</w>
si s
she ya</w>
le tse</w>
dzingek a</w>
dv we
cinisek o</w>
Nguye t</w>
Jes u,</w>
ya kho
ya Nkulunkulu</w>
vu sa</w>
si sebenti</w>
na lesi
loku hle</w>
lish umi</w>
ku yo
ce dze</w>
ba nge
an s</w>
N aka
( i
ya la</w>
tsemb iso</w>
tfun ti</w>
ri cs</w>
ku bantfu</w>
imi tsetfo</w>
hlam bi</w>
endlel eni</w>
bu ti</w>
wen a,</w>
t et
sebenti se</w>
phi la
li le,</w>
ku loku
ku lelo</w>
g el
eki le.</w>
cin isi
cham uka</w>
ba li</w>
1 4</w>
z i.</w>
wan e,</w>
tin d
r u</w>
om bolo</w>
ngi ba
nga -19
ng ako-ke</w>
lo tsa</w>
lesi vumelwane</w>
kan j
dolobha ,</w>
chum ana</w>
W ha
S wati</w>
Ma kha
y ,</w>
umbu so</w>
sa khe,</w>
sa belo</w>
pha wu
na ngem
ku lama
kho kha</w>
hluk ana</w>
ema ga
bu fakazi</w>
bon kulunkulu</w>
Si ve</w>
ts elela</w>
ta bo.</w>
ph a,</w>
no tfo</w>
gu cuk
d im
co la</w>
2 .</w>
nga wo</w>
les bian</w>
gam eni</w>
fak wa</w>
enti sa</w>
an ye</w>
aba zange</w>
C and
, ’</w>
vam e</w>
si b
la yet
ku ye.</w>
im ininingwane</w>
em u
ba tali</w>
an ani</w>
Ng o
Li f
yem i
yeku tsi</w>
vum o</w>
ts ana</w>
tj i
s ham
phan si,</w>
ngeph andle</w>
kan i</w>
inga ti</w>
esi hla
ca n</w>
bo wam
N oma</w>
N obe</w>
Ku tsi</w>
v ini</w>
tin hlobo</w>
nase ti
le se</w>
kusi ta</w>
kha kha</w>
hlu lela</w>
gun ya</w>
f ea
e ?</w>
dza la,</w>
dv o,</w>
ca li</w>
a ?</w>
Kum ele</w>
E si
C aba
yi Nkhosi</w>
tse tsel
ts eka</w>
ng cwa
k we</w>
is o
in ceku</w>
e Si
Nata sha</w>
Man je</w>
Jud a.</w>
yon i,</w>
yek ele</w>
ti tfu
sam i,</w>
s weni</w>
ny enti</w>
lo u
la lele</w>
khom ba</w>
hluph eka</w>
go d
cwa dzini</w>
bula wa</w>
ban dz
Joshu wa</w>
H i
z iny
si t
lw en
leli khulu</w>
lel a,</w>
kwa ze</w>
khici to</w>
k wa</w>
in cwadzi</w>
i ya</w>
hluk en
gci li</w>
ba khe.</w>
ang ana</w>
L a</w>
B uk
ta lo</w>
ta khe.</w>
na leti
lesi m
ka nga
fu yo</w>
beku bo
a tewu
a bo
Ma hlasela</w>
y ana</w>
nes s</w>
lo ngi
langa ba</w>
en khosini</w>
eku ca
W or
" Ku
w eli</w>
w ani</w>
u bo
tt le</w>
pho -ke</w>
on khe,</w>
len dvodza</w>
khe tsi
i d
fa ti,</w>
chaz elo</w>
ba sa
Si busiso</w>
S amu
P i
Ng e
Lu s
ve r</w>
tim iso</w>
she sha</w>
na ye.</w>
lo tawu
li -1
la ngeni</w>
g et
co sha</w>
bu suku</w>
bhu be
Wa se</w>
Cha ,</w>
yenti ,</w>
ti bo
sa khe.</w>
phum elelo</w>
pho hlo
ph eli
na ti
na lom
landzel ako:</w>
k ing</w>
hla laka
go dzini</w>
end eni</w>
bon a,</w>
and a</w>
U n
J ona
1 5</w>
we sive</w>
tsa tfu.</w>
tfwa la</w>
tfuny wa</w>
ngu lowo</w>
kw ente</w>
jo ngo</w>
eku seni</w>
dvo lo
Kh umbu
Jer emi
A se</w>
um nikelo</w>
ts en
tf a
ngan a
m ane</w>
ku tewu
ku t
h e</w>
A ha
ne -
k ing
ek o</w>
bu si</w>
ban i
ban dlu
ak eth
G rea
wa loko</w>
wa bona</w>
u te</w>
sin cumo</w>
lete hlukene</w>
le ?</w>
ku Simakadze.</w>
khe tfwa</w>
c )</w>
be ngi
ang o</w>
1 8</w>
-E d
ye n</w>
tin dzaba</w>
te tfu</w>
ngema mitha</w>
lo yawu
ha wu</w>
dli wa</w>
da lwa</w>
ch o
c i</w>
bom naka
ti tselo</w>
sem khatsini</w>
ph on
ngi tsi:</w>
lwan e,</w>
la ngu-
hla ka</w>
gcwa lis
g ra
e gameni</w>
dza dze
ban a
Sa ma
H lo
wam i.</w>
vi sisa</w>
tsini .</w>
th o
pha tfwa</w>
nga tsi:</w>
li nga
k ini,</w>
ik ele</w>
eki le,</w>
co bo</w>
S an
Ngem uva</w>
Len a
ta yo</w>
sindz isa</w>
ph iko</w>
nga leso</w>
na tsi</w>
kabu sha</w>
can e,</w>
T iko</w>
Ngen ca</w>
La bo</w>
-Ef ray
wa wa
um ka
ta la
s !</w>
ph ula</w>
nja lo
ngu M
n dzawo</w>
lesa si
kuba lu
ho lo</w>
dv we</w>
ba ngani</w>
Lo k
I sa
“ Ng
ziny ane</w>
ya tsi</w>
ulu .</w>
tak wenta</w>
si mi</w>
se .</w>
sa lom
sa g
s elwa</w>
r d</w>
ngu .</w>
la hla</w>
khi wo</w>
ka hle,</w>
jabu lo</w>
hlan yelo</w>
hho visi</w>
cuk e
Ne ga
La bel
Bhabhulona ,</w>
Abraha ma</w>
( 2)</w>
won khe.</w>
u ye</w>
tfuku tsel
nje ngoba</w>
ngum nikelo</w>
la khe.</w>
l ine</w>
ku bo,</w>
ki tsi</w>
ham bi</w>
ci tsa</w>
candz eka</w>
bonaka liso</w>
b eli</w>
Phet ro</w>
2 4</w>
ya ti</w>
wa kh
t ako</w>
si gaba</w>
r oni,</w>
ph i.</w>
ma ngo</w>
lesi n
le ti</w>
ga tjana</w>
g ca
fu leni</w>
yam i.</w>
tsi sa</w>
tfum ele</w>
t ,</w>
sha yam
s ente</w>
p p</w>
lesi dze</w>
kan ja
isi we</w>
i tsi</w>
hlu ka
hlo lo</w>
fun dze</w>
e .”</w>
dvum bu</w>
dvo dza,</w>
ban a</w>
T ho
Si bonelo</w>
M p
B uka</w>
3 0
ti sebenti</w>
ta wun
sh ini</w>
pha tsel
ph u</w>
ngu cuk
nga lelo</w>
lw eni.</w>
lesi nga
ish o
hloni pha</w>
eku f
dv wa,</w>
b ente</w>
yin i
wa yo</w>
wa li
th i
ta kho,</w>
se ka
phan si.</w>
on khe.</w>
ndzawon ye</w>
n onkhe</w>
n ini</w>
ma tima</w>
la bo
kwa loko</w>
kun ika</w>
ku yawuba</w>
khe ?</w>
el ane</w>
ek a.</w>
co ba</w>
Nga lelo</w>
Jes u.</w>
2 8
tinhla vu</w>
tfuku tselo</w>
p an
nya ngo</w>
li ciniso</w>
im u
ik i</w>
h e
e j
d i.</w>
ba lo</w>
a lu
Ku sukela</w>
Gi leya
5 0</w>
w ela
u se</w>
tf i
s ana</w>
phuma langa</w>
phi la.</w>
ni ti
manga la</w>
laph o,</w>
la se</w>
kwa khe.</w>
kunga ba</w>
ku leyo</w>
hla nga</w>
ham bo</w>
cish e</w>
Jako be,</w>
Ba yawu
zing eni</w>
weku cala</w>
th ani</w>
tfun j
sa ti
na -E
l le
kwa se</w>
khuluny wa</w>
ka ngak
h o</w>
f elo
esi khatsini</w>
en t</w>
ba fati</w>
Ti t
Phalam ende</w>
E li
ya ngeni</w>
wa ze</w>
wa ngi
ven tful</w>
ti ma
ti khatsi</w>
sikha tsi.</w>
ngum u
lo yo</w>
ku tsi
ku ny
khulu la</w>
e )</w>
E k
" N
wa ku
un eli
si bon
sh ana</w>
sa nga
nga yo.</w>
ng ele</w>
lon dvolo
li phu
lem inye</w>
lel ani</w>
kwem inyaka</w>
ha wu
bu t
2 5</w>
z u</w>
yin i,</w>
vide o
u wa
u bha
ta ti</w>
s )</w>
ni be</w>
lwan e.</w>
layet o</w>
hlo phe</w>
ba kho
a wo</w>
T ran
Sath ane</w>
L ong</w>
y iswa</w>
wan e.</w>
tseng isa</w>
ta se</w>
son dzela</w>
si tive</w>
s si
o ;</w>
ngen am
na nge
min e,</w>
lon yeni</w>
leli -1
laba hlala</w>
ku ngu
khatimu lo</w>
da la</w>
co u
co tfo</w>
bha liwe</w>
bh er
a yo</w>
Davi d</w>
B e</w>
.[ 1]</w>
yi li</w>
yi .</w>
wa mi
te bu
pho sto
p or
lo a
khum bi</w>
en hlitiyweni</w>
ema kha
be r</w>
ba khe,</w>
V ang
Sawu bona</w>
E s
A ngeke</w>
A bo
tim vu</w>
t ch</w>
son dz
ku neku
khomb ise</w>
ema -
eli dze</w>
bon ile</w>
be ta</w>
ba bo
a khe,</w>
T sa
P u
I N
yek we
we ;</w>
tu be</w>
ten u,</w>
t ra
si se</w>
ni tsi:</w>
lin ani</w>
lek i</w>
lahlek elwa</w>
iket we</w>
hlan yela</w>
hlaka lo</w>
ema lunga</w>
e dolobheni</w>
bh e</w>
ben u</w>
ban tfu
ang aka
a nge
a :</w>
Nga leso</w>
Ng etulu</w>
Bhabhu lona</w>
th ek
ta bo
nge -
ngan i
loku ,</w>
ek a,</w>
ben i,</w>
a ;</w>
1 3</w>
wa kho
v es
sipa la</w>
qu e</w>
m y</w>
loku khulu</w>
li dolobha</w>
lengi ku
leng th
la Simakadze,</w>
is eni</w>
ik ete</w>
i tha</w>
h lane</w>
gebe ngu</w>
el weni</w>
Ph o,</w>
N om
Lu sha
Le ng
Kh i
Deligh tful</w>
2 2</w>
-A f
wa hlala</w>
tja lo</w>
phi lako</w>
p on
ngu yise</w>
n ya</w>
lung iswa</w>
ku we.</w>
ku ta</w>
j wa
guc uka</w>
dza la.</w>
bha bha
bh eke</w>
U ne
Li fe</w>
J abu
He z
D u
we tin
ts ani</w>
ma s
lo ti
ka faneli</w>
im e
hla wulo</w>
da y
balu leke</w>
a t
Li vi</w>
ye t</w>
we tfu,</w>
vi vin
un tfu
si ye</w>
ng isa</w>
lwa khe</w>
len dzaba</w>
lel u</w>
le .”</w>
khulu ngwane</w>
ka ngaka
enti .</w>
e bantfu</w>
con dzi
bea u
ako -ke,</w>
a y
Bes t</w>
Be nga
yi -
x t</w>
vaka sh
ta to</w>
si li
omi di</w>
li lunga</w>
le ya</w>
kwa khe,</w>
kuphel a.</w>
g lobe</w>
e Jerusalema,</w>
bang ela</w>
Ngi tawu
Ku ta
Gibhith e,</w>
went eka</w>
vi le</w>
ti va
nje ngema
ngam ele</w>
men t</w>
le bu
hh u
gij ima</w>
en cwadzini</w>
ema khosi</w>
cin isa</w>
chu beke</w>
L ona</w>
wa cala</w>
u khuluma</w>
tsem beka</w>
th o</w>
tf uma</w>
sim bi</w>
phaka dze
jabu lisa</w>
is o,</w>
gcwa lisa</w>
fun dzi
fak we</w>
em phi
bam i,</w>
Si gaba</w>
H lala</w>
wa yawu
wa bu
wa -
tu bulo</w>
seb ente</w>
sa ba
ngi le,</w>
ngeti we</w>
nge sandla</w>
na letinye</w>
lo se</w>
lam i,</w>
kwen u</w>
kha li</w>
fea t.</w>
ema butfo</w>
dze be</w>
dvu dvu
ciph isa</w>
c ome</w>
bha li</w>
bandlu lu
a ze</w>
a b
Man je
Ham ba</w>
ye ba
wema -Israyeli,</w>
wa tfumela</w>
vum ela</w>
ts e,</w>
ti phatsa</w>
tesi ga
r s</w>
na yi
lwa kho</w>
la ben
is wa.</w>
imi bono</w>
a la</w>
P ho
Jeho ya
2 9
“ Si
tak we
ta wo</w>
sen tim
se tin
phatsel ene</w>
ngi be</w>
lu tfo,</w>
khon i</w>
d ne
co c
bh eka</w>
ba ti</w>
an ti.</w>
T se
S ise</w>
Ba se</w>
-A sh
v una</w>
ulum end
ti fiketi</w>
thanda za</w>
sa le</w>
ngu ,</w>
ngeli vi
le r</w>
lan g</w>
la hle</w>
khulu leko</w>
h lisela</w>
gu ngu</w>
em va</w>
c uma</w>
bo vu</w>
ban j
Sh i
Khristu .</w>
A u
2 .
1 7</w>
yaka tfo</w>
wem uk
we -
sib :</w>
phin dz
na lo</w>
laman yenti</w>
lam o</w>
lah leni</w>
kho di</w>
h lu</w>
guc ula</w>
buyis ela</w>
T em
J eh
x x
wen dlu
sin khwa</w>
sikha tsi,</w>
shayam tsetfo</w>
sh in
sem tsetfweni</w>
phak an
ngi li
na leli
le ts</w>
la khe,</w>
kwam i,</w>
ku ngaka
ku fike</w>
in dvodzakati</w>
hlangan yela</w>
hlakani phile</w>
h umu
fanek iso</w>
b ika</w>
a bha
Y enta</w>
Si fiso</w>
R es
Ng isho</w>
La pha</w>
? ’</w>
yet i</w>
wa chubeka</w>
sek elo</w>
s ti
ngi ko</w>
ngan ani</w>
ngak e
nan obe</w>
le kwaku
la pha
ku ko</w>
khu ba
hlukan isa</w>
hla sel
finy elela</w>
esi ko
ek ako</w>
cem be</w>
c wane</w>
busi sa</w>
an ta
Ngem nyaka</w>
Ku ngani</w>
Ku nga
Emp eleni</w>
A le
A g
yin i.</w>
wen u.</w>
ta yel
ta kho.</w>
t ani</w>
s om
s ako</w>
ngucuk o</w>
lel im
ku leti
khish wa</w>
im inikelo</w>
hla ngene</w>
h el
dz isa</w>
c we
c ulu</w>
bu t</w>
bu kha
be tive</w>
Y eku
T u
Ng am
Jer o
Hlu hlu
Hez eki
A sh
wa phindze</w>
w ek
u phindze</w>
u f
ti mali</w>
so n</w>
site :</w>
s ela
ph eli</w>
ngis a
ngem a</w>
la Nkulunkulu</w>
kw endlula</w>
ku hlala</w>
i li
hlan hla</w>
e k</w>
d li</w>
abu ye</w>
T j
Letin ye</w>
Ku sho</w>
He bher
u r</w>
sh ona</w>
sa bek
s ta
pu la
ngu we</w>
ngu laba
ngetin dlela</w>
ne sive</w>
lo wenta</w>
la kho,</w>
kwa kha</w>
ku Nkulunkulu,</w>
en ta
em etela</w>
ben i.</w>
Ye bo</w>
Tag :</w>
D ev
“ Nangabe</w>
z ana</w>
wem ukela</w>
wa tala</w>
len hle</w>
lel a.</w>
leku hlangan
ku we
j u</w>
in khosi,</w>
ik we</w>
er i</w>
e H
ci lo
beautiful ,</w>
L ele</w>
Ku khona</w>
4 )</w>
( 3)</w>
z ela</w>
z ane</w>
z am
vaka la</w>
va la</w>
uny e,</w>
um ntfwan
sh eni</w>
phel eni</w>
ng wa</w>
lu n
ku bete</w>
ho lela</w>
dza wo.</w>
cin ile</w>
bek et
ba tewu
a la
Vide o</w>
M bo
Label s:</w>
H ulumende</w>
E ma</w>
Cand leli
C ent
2 3</w>
-Ab raha
yis e,</w>
tj elwe</w>
ti ga
si ciniseko</w>
po liti
ph ela
lo kwaku
li cembu</w>
le kutsi</w>
labe ba
j iki
f t</w>
et we</w>
e !</w>
d )</w>
am u</w>
ak ekela</w>
Ngeli langa</w>
N ine</w>
A ba
ya lom
y ani
wem a</w>
w i</w>
tim o</w>
ti ya</w>
tali a</w>
sa kho,</w>
ph a.</w>
le N
kw eni</w>
ku ngenteka</w>
ku nem
khum ba</w>
hlan yel
hla bela</w>
fan ane</w>
em bili</w>
an ana</w>
a ye</w>
Ni yawu
Ngi cela</w>
ye s</w>
vumel ana</w>
phum elela</w>
p ar
ni kati</w>
nga ye</w>
ma langa</w>
m ak
li phi</w>
l enta</w>
kwa to</w>
ku yewu
ku te
ku lowo</w>
ka ngaka</w>
k i,</w>
hlon ish
esihla lweni</w>
dz ak
ca .</w>
Y ena</w>
Wa ba
W en
V isi
M hla
Lus tful</w>
Kh ulu
Kh u
Ju da
H ha
Ba be
A wu,</w>
A s
2 7
yaka -Israyeli,</w>
ya bo.</w>
y uka</w>
y eta</w>
wn loa
wa bo.</w>
v ang
tin hlitiyo</w>
thanda zo</w>
th i.</w>
te bantfu</w>
t ona</w>
si bo
phi la,</w>
phendvu la,</w>
le ka,</w>
ku sebentisa</w>
khoh lwa</w>
khe tse</w>
hh an
ha .</w>
gi dzi</w>
e hlan
e -ke</w>
W end
Nam e:</w>
A wu
“ Na
yaka Juda,</w>
tfum ba</w>
ta ma
suku ma</w>
r emu</w>
ngi funa</w>
lu khuni</w>
lo w</w>
lama khulu</w>
laba bi</w>
la b
kwe bantfu</w>
kuleli ve</w>
ku setjentiswa</w>
khu ba</w>
ent ele</w>
em bu
el is
ba wa
Kwa ba</w>
Ku ya
Bh ethi</w>
Bek a
Afri ka,</w>
yin cenye</w>
vumel wano</w>
um n
u ya</w>
u tfole</w>
tsi te.</w>
tsemb isa</w>
tsam ba
tam i,</w>
ri ya
nge sheya</w>
nga se</w>
lw ema
lung isa</w>
li mi</w>
le fan
in ika</w>
em tim
em ny
eGibhith e,</w>
dvu tane</w>
aketh e</w>
W e</w>
M and
Li tiko</w>
Khristu ,</w>
Davi de.</w>
1 6</w>
yent eka</w>
wa bo,</w>
tsin tsek
sin tfu</w>
si fo</w>
sebenti ,</w>
phe tfo</w>
ni ngi
li cinis
leku fanele</w>
ku lolu
ku khuluma</w>
ku hamba</w>
ku bo.</w>
er o
dza beni</w>
comm ents</w>
ban dzela</w>
a bo,</w>
W enta</w>
S onkhe</w>
S ho
P ar
L wandle</w>
Jero bowam
J une</w>
Ima ges</w>
D el
( c)</w>
we tfu
ph o,</w>
ona l</w>
ni bo
ngumu phi</w>
lo ve.</w>
le kumele</w>
la tsi:</w>
kam bu</w>
hawu k
h lele</w>
h l
de n</w>
ca ,</w>
be tfu</w>
ba phrofethi</w>
Y i
W el
R obe</w>
Nan obe</w>
N kulu
Lo d
F in
ya wo.</w>
tha ,</w>
t ri
sungu la</w>
sindz iso</w>
sebu khosi</w>
nga ba
letin tsatfu</w>
laph o.</w>
la ?</w>
ko tela</w>
kh ela</w>
in hloko</w>
hlalaka hle</w>
en si</w>
e ve</w>
dza ba.</w>
c u</w>
bin dzi</w>
an o</w>
Mo de
Lo ve</w>
Ema lahleni</w>
? ?</w>
1 9</w>
vun o</w>
tu lu
tj elwa</w>
thek s
sin i,</w>
r in
ngi si
ngeti khatsi</w>
kwe sikhatsi</w>
ku so</w>
ku sha
ku lem
h lwa</w>
am i,</w>
aka ,</w>
Si khatsi</w>
Hluhlu we</w>
yeku cala</w>
ya lo
wand le,</w>
wa vel
u bh
tj u
sa ti</w>
s wane</w>
s h</w>
ni .</w>
nga yi
nema dvodza</w>
lo yi
lis we</w>
ku va</w>
kho sikati</w>
khici ta</w>
im phi</w>
ge d</w>
en u,</w>
e tfu</w>
d uk
ci al</w>
ban jwa</w>
a bem
U ni
Khomish ani</w>
B eth
A N
yin dzawo</w>
y :</w>
um naka
tfu lu
tel angana</w>
seb entela</w>
ngum tsetfo</w>
ngu siphi</w>
nga lesikhatsi</w>
ng eta</w>
m ine
lwa mi</w>
lo li
lo kulu
lo ba
kini :</w>
ini ?</w>
i .”</w>
ema phu
dvwa ngu</w>
caba ngo</w>
L ela</w>
Ch ris
A ngel
3 :
wa buta</w>
wa ;</w>
uyawu ba</w>
tsa pp</w>
tfo lwa</w>
tf we
ta ba</w>
shuma yela</w>
ri ya.</w>
ph un
lw im
lw eni,</w>
lu hlobo</w>
loku fanele</w>
li la
la :</w>
khe ts
is e,</w>
ema nga</w>
bange t</w>
ba ze</w>
ba ta
ba kho,</w>
a f
S te
Le s</w>
Ba fundzi</w>
â €
wu la</w>
wnloa d</w>
we suka</w>
vum ele</w>
tsin i,</w>
tsa tfwe</w>
t ani
si na
phe tfwe</w>
pham ban
p ro
o ku</w>
na ngema
na leyo</w>
na len
lu tsandvo</w>
les bi
landz ele</w>
la yo</w>
kw enti
ko lo</w>
inya ma</w>
hla li</w>
goli de,</w>
dzabu la</w>
b ini</w>
a t</w>
W am
Ng el
Ne xt</w>
yem untfu,</w>
wa zi</w>
vam ise</w>
tsa tfu,</w>
tf wele</w>
te n</w>
so lom
sh es
se r
phe pho</w>
pha tse</w>
o :</w>
ngu yiphi</w>
ng iso</w>
nak an
na we,</w>
na la
kwent eke</w>
khomb isa,</w>
keti ng
is elwe</w>
hlo ,</w>
d ini</w>
bongo lo</w>
as ham
W il
Samu weli</w>
Ri pha
Na ti
B en
wam phendvula</w>
u ye
tin yatselo</w>
tin cwadzi</w>
t enta</w>
t ela
ngeti n</w>
lu laka</w>
lu hlelo</w>
laph a,</w>
ku ngen
kha mi
ke tawa
is ani</w>
e Jerusalema.</w>
bel ana</w>
bandz akan
a lo</w>
S ear
P ro
Ngu ye</w>
L amu
Jes u
G lobe</w>
4 0</w>
) ;</w>
y ente</w>
wa len
to s</w>
tin dvuna</w>
shi ye</w>
p er
ng ane</w>
m p
li te</w>
li ngani</w>
lasi hlanu</w>
lam u</w>
ku to
iny akeni</w>
hlo lwa</w>
eku gcineni</w>
da li</w>
cinisi le,</w>
ba bo,</w>
anananan anan
an ti
a kho,</w>
Ma ye,</w>
A ll</w>
A be</w>
2 ,</w>
wun i
wum be</w>
w or
u ngeke</w>
u nge
u la
tim e.</w>
sa bo</w>
s ona</w>
on khe
o r</w>
ngi yi
ngco lile</w>
ma ti</w>
ma khelwane</w>
la pho-ke</w>
kwa ko</w>
ku fika</w>
khumbu le</w>
is wa,</w>
i Ndvodzana</w>
esi d
er i,</w>
en yangeni</w>
ema ,</w>
c im
buk eka</w>
bu khosi</w>
bam bel
baka -Israyeli</w>
ba khuluma</w>
b li
a .”</w>
V eli
2 ]</w>
! !!</w>
“ Ni
um e</w>
uk i</w>
th ish
phohlo ngo</w>
ngi cela</w>
na leso</w>
lu dvumo</w>
laba ti
la kho.</w>
l iny
kanga ngekutsi</w>
hla zo</w>
fu te</w>
fu ngo</w>
enti ,</w>
em uk
bantfwan a.</w>
Um tsetfo</w>
Mar keting</w>
K res
2 6
yis we</w>
wen ya</w>
wa loku
vi e
tsetfo sisekelo</w>
so tja</w>
ph ek
o ?</w>
nge sekudla</w>
nga ku
nem untfu</w>
masin yan
lo kwe
li thempeli</w>
lebe yi
la Simakadze.</w>
k en
inik e</w>
i :</w>
i )</w>
ham ba,</w>
gwa co</w>
gco ba</w>
g )</w>
fundz eni</w>
fun e</w>
fi le,</w>
eGibhith e</w>
ba tfo</w>
ba sebenti</w>
a c
U tawu
Ng ako-ke,</w>
N ini</w>
N d
F ran
5 )</w>
! ’</w>
zulw ini</w>
yi le</w>
ye N
y be</w>
tful .</w>
sebenti si</w>
s s
o to</w>
ni tewu
ngo tsi</w>
ngc o</w>
na labanye</w>
lu tfo.</w>
l ente</w>
kun cono</w>
ku ngi
kh eli</w>
i ta
etj enti
emhlaben i.</w>
ba fike</w>
a bone</w>
Se ngi
N iketa</w>
Ma ye</w>
Life time</w>
Ku dla</w>
Jo wa
A ngeli
" Si
yem be
ye bantfu</w>
ye ;</w>
yak wati</w>
w .</w>
un i</w>
o ngo</w>
ng we</w>
na sa
masin yane</w>
li tawu
laba dzala</w>
la leli</w>
la g
kim i.</w>
khutsa ta</w>
i Jord
el elwa</w>
dzabu ko</w>
dv uku</w>
ban ika</w>
and le,</w>
La pho</w>
Isray eli</w>
Gibhith e.</w>
Emvak waloko</w>
Ban tfwana</w>
3 .</w>
1 .</w>
yis e.</w>
vim bela</w>
uya ku
uny enti</w>
tin ceku</w>
tim ende</w>
suku .</w>
ngen kem
ngaphin dze</w>
li zinga</w>
letin cane</w>
kwa yo</w>
ku -A
jez isa</w>
j ini</w>
i r</w>
g ca</w>
esiga beni</w>
er a</w>
ekha ya.</w>
c ke
be se
Unga yi
Ngi yaku
Ng ek
In take</w>
Ar oni</w>
vik eleka</w>
um nya
tsembek ile</w>
tful ,</w>
sim ini</w>
sa Velonkhe</w>
r and
phum phu
ph uny
ph elo</w>
nem isebenti</w>
lek ela</w>
kwe tfu</w>
kh ani</w>
imi buto</w>
i bha
hluken e.</w>
fu tsi
ema khaya</w>
dz ile</w>
bu yele</w>
bon khe.</w>
ba yaku
Y o
S ekela</w>
Nega tive</w>
N ya
Eti ket
“ M
yenti we</w>
u yin
u sho</w>
solom ane</w>
sh on
sa Simakadze</w>
ngi ngu
nga bona</w>
na ye,</w>
m eni</w>
lungis elela</w>
lo ngum
lo b
la gi
ing o
buk kake</w>
bambis ana</w>
b iso</w>
ak wati</w>
Ng eke</w>
Busi siwe</w>
Bha lo</w>
wa l
wa :</w>
w ha
vu .</w>
vi si
ut h</w>
um lilo</w>
u ka
ti we</w>
s wel
r i.</w>
phak em
p la
ngeku ya</w>
ngek wenta</w>
lo ng
lo ;</w>
len a
kutawu ba</w>
ku tje</w>
ka dze</w>
g en
fundz iso</w>
el eli</w>
buk ene</w>
bu ki
bu bi</w>
ba ngeke</w>
a sho</w>
Lom unye</w>
L y
K wenta</w>
In di
Gi be
ya bo,</w>
u hlala</w>
tion s</w>
tim isele</w>
ti tawu
shona langa</w>
phaka dze,</w>
omi ti</w>
ngum sebenti</w>
ngem li
ngeku shesha</w>
na Ma
lomu bi</w>
letin khulu</w>
leku cala</w>
l enti</w>
ku tfo
i kakhulu</w>
hlo ph
h we
h ulumend
h leni</w>
fu la
dv uma</w>
caba nge</w>
c uny
bu te</w>
aka la</w>
a tawu
Th i
Sa ra
S ta
Lo ngcwele</w>
Ch i
A ma
3 .
â€ ¢</w>
z a,</w>
wa ta
tj o
ti thico</w>
ti f
tfutfuk iswa</w>
te :</w>
sungu lwa</w>
suku ,</w>
si ne
sa yo</w>
ra l</w>
lish a</w>
lin i.</w>
li tfuba</w>
lasi khombisa</w>
khon te</w>
khe tfwe</w>
kanja lo-ke</w>
h lis
ema Juda</w>
ce nga</w>
S em
Len dvodza</w>
Ku sebentisa</w>
Jo wabe</w>
F aka
A dv
( feat.</w>
z o
ye sive</w>
wa di</w>
u yewu
u m</w>
u ca
tin yawo</w>
t uma</w>
t te</w>
o k</w>
ngel in
na sema
m es
len cane</w>
lek ile.</w>
le !</w>
la leli
khwa ma</w>
in dzima</w>
i ti
h lisa</w>
fu tsi.</w>
es uka</w>
es .</w>
ekuca leni</w>
e -A
dolobha .</w>
bu l
an dz
a yin
a khuluma</w>
Si busisiwe</w>
S er
Ne bukha
Jeremi ya</w>
ya to</w>
tin i,</w>
si bonelo</w>
s wati</w>
ni yi
ngulu be</w>
lung ele</w>
longuSom andla,</w>
longu Nkulunkulu</w>
loku nye</w>
les bo</w>
lamu hla.</w>
laba ku
la yi
kwa wo</w>
kwa kho.</w>
khami ti</w>
kh ele</w>
keta wa</w>
im e</w>
e tfu
e m</w>
e ."</w>
beautiful .</w>
a to</w>
a le
a hamba</w>
] [
Tim eline</w>
P la
Nebukha dne
Mowa bi</w>
M khandlu</w>
Kwa se</w>
Benga li</w>
A kusi
“ Kodvwa</w>
weku tsi</w>
un ye.</w>
u ng
tj i</w>
se ngatsi</w>
phosto li</w>
ngen eni</w>
nen dzawo</w>
ne t</w>
lwe si
li kha
le ngcwele</w>
kubha liwe</w>
ku hle</w>
j eni</w>
hlu kuny
hlan tek
get s</w>
fan ele.</w>
f i</w>
ema tfuba</w>
ema g
ehlu ko</w>
ca l</w>
N ani
Abo ut</w>
' .</w>
z ini</w>
we ti</w>
we ba
v uk
uneventful .</w>
um yalo</w>
um phristi</w>
um phefumulo</w>
r a,</w>
q aba</w>
ngek wa
nga- 200
n dlela</w>
lokungen ani</w>
li bhokisi</w>
lemi bili</w>
kwe fika</w>
kuphel a,</w>
ku vu
ku ma</w>
ku khala</w>
khomb isa.</w>
khi log
is elwa</w>
in o</w>
ho lesa
em lonyeni</w>
eli siwe</w>
ebu suku</w>
dza buka</w>
dvum ise</w>
dlel wane</w>
co m</w>
and le.</w>
an ti,</w>
ako ?</w>
a wa</w>
a fike</w>
Une ventful</w>
Tit le:</w>
P et
Makha dzi</w>
C ar
Bhenjam ini</w>
tsemb ele</w>
th ani,</w>
tfu lwa</w>
setjenti swe</w>
p ak
ngem pela</w>
nga la</w>
na mi
na Nkulunkulu</w>
lu sendvo</w>
lo :</w>
le ngu
lam ane</w>
l ,</w>
ku letin
ku be
hlaz ana</w>
ge t</w>
fan an
es t</w>
el ene</w>
ek went
con dvweni</w>
bu le
bha liswa</w>
an ce</w>
T e
Nebukhadne zar
N cwane</w>
L emi
Ar tic
00 0,</w>
“ Ba
yis eb
yea r</w>
ya wun
utawu ba</w>
u ngeli
ton dza</w>
t eni</w>
se -
p i</w>
ngi yo</w>
ngel im
ne ta
na ti</w>
n um
manga liso</w>
li ngana</w>
lema li</w>
la wa</w>
la ma</w>
kwem andla</w>
ku lo.</w>
khulu n
kh wen
is o.</w>
i phindze</w>
hlangabe tana</w>
hlam bulu
eth i,</w>
en g</w>
ela nga</w>
co ca</w>
bu ka,</w>
bhube si</w>
_ _</w>
Y ou
Ma ri
Buk kake</w>
wa velonkhe</w>
wa buyela</w>
um phristi,</w>
u ngaka
tsan dvwa</w>
ts e.</w>
to r</w>
tfuku tsela</w>
ta yi
t ch
si ba
sel oku</w>
se tsembiso</w>
sa ngo</w>
sa kho.</w>
phrofeth i,</w>
ngen yanga</w>
na li
m on
lesi ve</w>
ku sh
ku khanya</w>
ku bh
kho lwa,</w>
khilog remu</w>
in a,</w>
felo kati</w>
eth endeni</w>
d le
c iko</w>
a sha
Tag s:</w>
Sear ch</w>
Na ngi
Ma futsa</w>
In ter
Bek ati
2 :
za lwane,</w>
uya ba
u hambe</w>
ti hlahla</w>
si se
sek elwa</w>
sa tsi:</w>
ph im
ni tawu
ngel ini
mu ti</w>
ma nga</w>
ku fundza</w>
khu lisa</w>
khan yeti</w>
hhan ca</w>
ham bisa</w>
go g
ge za</w>
g h</w>
ema dolobheni</w>
em ak
d a,</w>
bhaka bh
bek ela</w>
ba khona</w>
b ham
am i
a ta
a khe.</w>
Um sebenti</w>
U tsi</w>
E sa
8 .</w>
5 :
-Am or
y we</w>
vim be
uk o</w>
theks thi</w>
tf on
sa ya</w>
ra .</w>
phon dvo</w>
ngek wesi
ng condvo</w>
ne bantfwa
nan je
na loko</w>
n u
lw ini</w>
lom sebenti</w>
lawu la</w>
ku tsatsa</w>
fundz ise</w>
esi te</w>
emhlaba tsini</w>
ema ve</w>
em ake</w>
condz ene</w>
cin a</w>
chu ba</w>
c un
bon wa</w>
ang el
ako ;</w>
U bo
T ra
F or
? '</w>
- nje</w>
( sib:</w>
yim fi
weku busa</w>
vivin yo</w>
un ina</w>
tin hlo
she she</w>
nema dvodzakati</w>
na so</w>
ly rics</w>
lo hlala</w>
lo ?</w>
lem inyenti</w>
ku laka
kh er
hla lesa
e dolobh
a ."</w>
a -ke</w>
S fiso</w>
Mtsetfo sisek
Ku lungile</w>
In dzawo</w>
Im isebenti</w>
201 7</w>
2 7</w>
“ Simakadze</w>
yin ye,</w>
wa phuma</w>
wa ngena</w>
tfu si</w>
tati on</w>
sh i.</w>
ngi ngetin</w>
ng isi</w>
nak enu</w>
n is
li lungelo</w>
letin e</w>
le tsi</w>
le ka
laba khulu</w>
kwa lom
kam bu
kakhulu kati</w>
is ako</w>
in tsandvo</w>
i ngi
fundz isi</w>
fun dza.</w>
fi hla</w>
eti keti
dv wa.</w>
d ,</w>
cu sa</w>
an eni</w>
Y onkhe</w>
Vang eli</w>
Tin tfo</w>
Simakadze .”</w>
Si celo</w>
La Maga
Jeho sha
Ham bani</w>
4 .
3 1
“ La
yin dlela</w>
tse tse</w>
ti lwimi</w>
thu la.</w>
te s</w>
so la</w>
phum elele</w>
phi lis
p )</w>
ngu kuphi</w>
nam i,</w>
loku faka</w>
lel e
kulu nga</w>
ku leso</w>
khe tfo</w>
kan to
in kemba</w>
i ngilosi</w>
hlo ni</w>
gwa c
e ban
cwan ingo</w>
Ma si
Le ar
Ek lenti</w>
Do wnload</w>
3 ,</w>
201 8</w>
ya laba
un em
um biko</w>
tim eline
sag t:</w>
re khodi</w>
phum ula</w>
ngi taku
ngcwel e
ne M
lindz ele</w>
li tsemba</w>
li f
le ."</w>
ku dla,</w>
khokh ela</w>
ham bela</w>
gcu gcu
fu tsi,</w>
fik ile</w>
ezulw ini</w>
etiketi :</w>
et te</w>
en ini</w>
ema veni</w>
dzingek ile</w>
dza buk
d lelo</w>
bhu li
bha lwa</w>
bh an
ba hlala</w>
ang um
Se wu
Leti sha</w>
6 .</w>
00 .</w>
‘ Naku</w>
yi N
we fika</w>
ti swa</w>
tfom bo
s ta</w>
s ani</w>
pho yis
o t</w>
njenga loku</w>
nge tim
ng s</w>
na bo.</w>
m er
lokum ele</w>
lam e</w>
kwe hlu
ku yo.</w>
ko ;</w>
khu le</w>
khe .”</w>
k ini.</w>
hlel wa</w>
fak i</w>
eti kwe
ch eme</w>
bula le</w>
bon isa</w>
bom ake</w>
bi ya</w>
bha ,</w>
be sito</w>
ak i
a ya</w>
Solom oni,</w>
Sawu la,</w>
N co
Mbo ngeni</w>
Ema -Israyeli</w>
Bekati '</w>
" M
yem a</w>
ya ?</w>
we ?</w>
waba phendvula</w>
wa bita</w>
usi c</w>
u ze</w>
tin ikela</w>
th er
ta si
si tewu
si ku
sh we</w>
sh an
seni ngizimu</w>
sa kho
nga bo</w>
ng oma</w>
nem hlaba</w>
li yawu
le tsite</w>
la lala</w>
kun iketa</w>
kulun kulu
ku kholwa</w>
ing eli
in dvuna</w>
i t</w>
hlangan weni</w>
et ulu,</w>
er esi
d on
d :</w>
bon khe,</w>
ba yo</w>
Th an
Ng in
Ng c
Lif eline</w>
L elo</w>
Ku yawu
E x
Ba r
A tsi</w>
ya lo,</w>
y ani</w>
vo ti</w>
vo ca
u ro
tin dlu</w>
thu la,</w>
ten u.</w>
ta l</w>
ph andle</w>
nya .</w>
nga-19 9
na ?</w>
lu tfo
lomu sha</w>
lom ntfwana</w>
li ve.</w>
li ve,</w>
leti se
leli dolobha</w>
le ka.</w>
ku phele</w>
j ana</w>
ge z
ga la</w>
ema Levi</w>
em inyakeni</w>
elu la</w>
dz ani</w>
do kotela</w>
co lis
bu dzala,</w>
ba phindze</w>
a kho
W eku
Ripha bhuli
Nkulu leko</w>
New s</w>
Lu ng
Hebher u</w>
2 9</w>
ti si</w>
tfomba tana</w>
ta tsi:</w>
pa si
nyaka .</w>
ny ele</w>
nom e-ke</w>
ngeli vi</w>
ngaloku phelele</w>
loko -ke</w>
li tsi:</w>
lesi khombisa</w>
le sem
ku lwa</w>
ku dla
kho sini,</w>
ka hle
in a.</w>
ik isa</w>
ekwent eni</w>
ba dze</w>
b isho
an dza</w>
a dv
Y em
W i
V er
Tsa tsa</w>
So uth</w>
S esi
Nkulunkulu ?</w>
